DataProcessors/ПечатьОферт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьОферт</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОферты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоручения</Name>
					<Comment>Дата удаляемого поручения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Опционы</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияОферт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияОферт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АкцептС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АкцептПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеУсловий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОферты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфертПоОблигациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбъявления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоДляФизическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиПоДенежнымСредствамСобственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоДенежнымСредствамСобственные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКодовВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКодовВТорговыхСистемах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSBoard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодВДепозитарии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CFI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБКраткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSStandart</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПечатьОферт/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьДанныеШапка(ЦеннаяБумага, ДатаОтч, Организация, Подписант)
	
	Данные = Новый Структура("ISIN,Эмитент,Тип,РегНомер,ДатаРегистрации,Серия,Валюта,ДатаВыкупа,ЦенаПроцент,Цена,ОписаниеУсловий,КраткоеНаименованиеПоУставу,Должность,ОснованиеПолномочий");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Облигации.Ссылка,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, """") КАК Эмитент,
		|	Облигации.Тип,
		|	Облигации.ГосударственныйРегистрационныйНомер КАК РегНомер,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
		|	Облигации.ВалютаНоминала.НаименованиеПолное КАК Валюта,
		|	Облигации.ДатаРегистрации,
		|	Облигации.НомерВыпуска КАК Серия,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, """") КАК КраткоеНаименованиеПоУставу,
		|	УсловияОферт.ДатаВыкупа,
		|	УсловияОферт.ЦенаПроцент,
		|	УсловияОферт.Цена,
		|	УсловияОферт.АкцептС,
		|	УсловияОферт.АкцептПо,
		|	УсловияОферт.ОписаниеУсловий
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|			&ДатаОтчета,
		|			Объект = &ЦеннаяБумага
		|				И ВидКода = &ISN) КАК КодыВТорговыхСистемахСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&ДатаОтчета,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							Облигации.Эмитент.ЮрФизЛицо
		|						ИЗ
		|							Справочник.Облигации КАК Облигации
		|						ГДЕ
		|							Облигации.Ссылка = &ЦеннаяБумага)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО Облигации.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|			ПО Облигации.Ссылка = УсловияОферт.Облигация
		|		ПО КодыВТорговыхСистемахСрезПоследних.Объект = Облигации.Ссылка
		|ГДЕ
		|	Облигации.Ссылка = &ЦеннаяБумага
		|	И УсловияОферт.ДатаВыкупа = &ДатаОтчета";
	
	Запрос.УстановитьПараметр("ISN", Перечисления.ВидыКодовВТорговыхСистемах.ISIN);
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтч);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Данные, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Должность,
		|	КонтактныеЛица.ОснованиеПолномочий
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Подразделение = &Подразделение
		|	И КонтактныеЛица.Язык = &Язык
		|	И КонтактныеЛица.Объект = &Объект
		|	И КонтактныеЛица.КонтактноеЛицо = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("КонтактноеЛицо", Подписант);
	Запрос.УстановитьПараметр("Объект", Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Подразделение", Справочники.Подразделения.ГруппаКомпаний);
	Запрос.УстановитьПараметр("Язык", Справочники.Языки.Русский);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Данные, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеТЧ(Знач Данные, ДатаОтч, Организация, СчетДУ, Брокер)
	
	Данные.Вставить("ПолноеНаименованиеПоУставу");
	Данные.Вставить("КодКлиента");
	Данные.Вставить("НомерДоговора");
	Данные.Вставить("ДатаДоговора");
	Данные.Вставить("НаименованиеДляДокументов");
	Данные.Вставить("Код");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо.Код КАК КодКлиента
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаОтч,
		|			Организация = &Организация И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|			И ЮрФизЛицо В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|				ИЗ
		|					РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&датаОтч, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаОтч", ДатаОтч);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Данные, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговора,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаДоговора,
		|	ВЫБОР
		|		КОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ОсновнойБрокер,
		|	ВЫБОР
		|		КОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НаименованиеВладельцаДляДокументов = """"
		|			ТОГДА ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Договор.НаименованиеВладельцаДляДокументов
		|		ИНАЧЕ ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НаименованиеВладельцаДляДокументов, """")
		|	КОНЕЦ КАК НаименованиеДляДокументов,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаОтчета,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Брокер = &Брокер
		|				И Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновнойБрокер";
	
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтч);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(Данные, ВыборкаДетальныеЗаписи);
	КонецЦикла;

	Возврат Данные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСотрудниковОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.КонтактноеЛицо
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Объект = &Объект";
		
	Запрос.УстановитьПараметр("Объект", Организация.ЮрФизЛицо);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");
	
КонецФункции // ПолучитьСотрудниковОрганизации


&НаКлиенте
Функция СформироватьНомерПоручения(Данные)
	
	Возврат "" + Формат(Объект.ДатаПоручения, "ДФ=dd") + Формат(Объект.ДатаПоручения, "ДФ=MM") + Формат(Объект.ДатаПоручения, "ДФ=yy") + "/" + Данные.Код + "/" + Данные.РегНомер;

КонецФункции

&НаКлиенте
Процедура ПечатьПоручениеГПБ()
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПоручениеГПБ");
	
	ДанныеШапка = ПолучитьДанныеШапка(Объект.ЦеннаяБумага, Объект.ДатаОферты, Объект.Организация, Объект.Подписант);

	Для Каждого СтрТабл Из Объект.СчетаДоверительногоУправления цикл
		
		Данные = ПолучитьДанныеТЧ(ДанныеШапка,Объект.ДатаОферты,Объект.Организация,СтрТабл.СчетДоверительногоУправления,Объект.Брокер);

		имяВременногоФайла = ПолучитьИмяВременногоФайла();
		Макет.Записать(имяВременногоФайла);
		
		Word = Новый COMОбъект("Word.Application"); 
		
		ТекДок = Word.Documents.ADD(имяВременногоФайла);
		ТекДок.Variables("dat").Value=Объект.ДатаОферты;
		ТекДок.Variables("ПолноеНаименованиеКлиента").Value=Данные.НаименованиеДляДокументов;
		ТекДок.Variables("Организация").Value=СокрЛП(Объект.Организация);
		ТекДок.Variables("КодКлиента").Value=Данные.Код;
		ТекДок.Variables("ДатаДоговораБрокер").Value=Формат(Данные.ДатаДоговора,"ДЛФ=DD");
		ТекДок.Variables("НомерДоговораБрокер").Value=Данные.НомерДоговора;
		ТекДок.Variables("РегНомер").Value=Данные.РегНомер;
		ТекДок.Variables("ISIN").Value=Данные.ISIN;
		ТекДок.Variables("Эмитент").Value=Данные.Эмитент;
		ТекДок.Variables("Количество").Value=СтрТабл.Количество;
		ТекДок.Variables("Процент").Value=Данные.ЦенаПроцент;
		ТекДок.Variables("Сумма").Value=Формат(СтрТабл.Сумма,"ЧЦ=17; ЧДЦ=2");
		ТекДок.Variables("Валюта").Value=Данные.валюта;
		ТекДок.Variables("СрокДействия").Value=Данные.ДатаВыкупа;
		ТекДок.Variables("ДопУсловия").Value="СДЕЛКА РПС, Агент "+СокрЛП(Объект.Агент)+", Код расчетов Т0, срок выставления заявки "+СокрЛП(Объект.срок);
		ТекДок.Variables("НачОтдела").Value=СокрЛП(данные.Должность)+"  "+СокрЛП(Объект.Подписант);
		
		ТекДок.Fields.Update();
		
		Word.ActiveWindow.View.ShowFieldCodes = False;
		Word.Visible=Истина;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьОНамеренииПродатьГПБ()
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("НамерениеПродатьГПБ");
	
	ДанныеШапка = ПолучитьДанныеШапка(Объект.ЦеннаяБумага,Объект.ДатаОферты,Объект.Организация,Объект.Подписант);
	
	имяВременногоФайла = ПолучитьИмяВременногоФайла();
	Макет.Записать(имяВременногоФайла);
	
	Word = Новый COMОбъект("Word.Application"); 
	
	ТекДок = Word.Documents.ADD(имяВременногоФайла);
	ТекДок.Variables("dat").Value=Объект.ДатаОферты;
	ТекДок.Variables("Организация").Value=СокрЛП(Объект.Организация);
	ТекДок.Variables("РегНомер").Value=ДанныеШапка.РегНомер;
	ТекДок.Variables("ДатаРегистрации").Value=ДанныеШапка.ДатаРегистрации;
	ТекДок.Variables("Серия").Value=ДанныеШапка.Серия;
	ТекДок.Variables("Номинал").Value=ДанныеШапка.Цена;
	ТекДок.Variables("Эмитент").Value=ДанныеШапка.КраткоеНаименованиеПоУставу;
	ТекДок.Variables("НачОтдела").Value=СокрЛП(ДанныеШапка.Должность)+"  "+СокрЛП(Объект.Подписант);
	
	ВсегоТаблиц = Word.Application.ActiveDocument.Tables.Count;
	Если ВсегоТаблиц = 0 тогда //в документе word нет таблиц для заполнения  
		ВызватьИсключение "В документе word нет таблиц для заполнения. Обратитетсь к программисту";
	КонецЕсли;
	
	wordTable=Word.Application.ActiveDocument.Tables(1);
	wordRows=wordTable.Rows; 
	
	Ном=1;
	
	Для Каждого СтрТабл Из Объект.СчетаДоверительногоУправления цикл
		
		Данные = ПолучитьДанныеТЧ(ДанныеШапка, Объект.ДатаОферты, Объект.Организация, СтрТабл.СчетДоверительногоУправления, Объект.Брокер);
		
		beforeRow=wordRows.Item(ном);               
		wordRows.Add(beforeRow);
		
		строкаДок="
			|№ "+Данные.НомерДоговора+" от "+Формат(Данные.ДатаДоговора,"ДЛФ=D")+"г. "+Данные.НаименованиеДляДокументов+" в количестве "+СтрТабл.Количество+" ("+ЧислоПрописью(СтрТабл.Количество,,",,,ж,,,,ж,0")+") штук ";
		inRow=wordRows.Item(ном);      
	
		inRow.Cells(1).Select();
		Word.Application.Selection.InsertAfter(строкаДок);
		ном=ном+1;
	КонецЦикла;
	
	ТекДок.Fields.Update();
	Word.ActiveWindow.View.ShowFieldCodes = False;
	Word.Visible=Истина;
		

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоручениеНаОтменуБКРегион()
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ОтменаПорученияБКРегион");
	
	ДанныеШапка = ПолучитьДанныеШапка(Объект.ЦеннаяБумага,Объект.ДатаОферты,Объект.Организация,Объект.Подписант);
	
	Для Каждого СтрТабл Из Объект.СчетаДоверительногоУправления цикл
		
		Данные=ПолучитьДанныеТЧ(ДанныеШапка,Объект.ДатаОферты,Объект.Организация,СтрТабл.СчетДоверительногоУправления,Объект.Брокер);

		имяВременногоФайла = ПолучитьИмяВременногоФайла();
		Макет.Записать(имяВременногоФайла);
		Word = Новый COMОбъект("Word.Application"); 
		ТекДок = Word.Documents.ADD(имяВременногоФайла);
		ТекДок.Variables("dat").Value=Объект.ДатаОферты;
		ТекДок.Variables("datStr").Value=Формат(Объект.ДатаОферты,"ДЛФ=DD");

		ТекДок.Variables("ПолноеНаименованиеКлиента").Value=Данные.НаименованиеДляДокументов;
		ТекДок.Variables("Организация").Value=СокрЛП(Объект.Организация);
		ТекДок.Variables("КодКлиента").Value=Данные.Код;
		ТекДок.Variables("ДатаДоговораБрокер").Value=Данные.ДатаДоговора;
		ТекДок.Variables("НомерДоговораБрокер").Value=Данные.НомерДоговора;
		ТекДок.Variables("РегНомер").Value=Данные.РегНомер;
		ТекДок.Variables("ISIN").Value=Данные.ISIN;
		ТекДок.Variables("Эмитент").Value=Данные.Эмитент;
		ТекДок.Variables("Количество").Value=СтрТабл.Количество;
		ТекДок.Variables("Процент").Value=Данные.ЦенаПроцент;
		ТекДок.Variables("Сумма").Value=Формат(СтрТабл.Сумма,"ЧЦ=17; ЧДЦ=2");
		ТекДок.Variables("Валюта").Value=Данные.валюта;
		ТекДок.Variables("СрокДействия").Value=Данные.ДатаВыкупа;
		ТекДок.Variables("Подписант").Value=СокрЛП(данные.Должность)+"  "+СокрЛП(Объект.Подписант);
		ТекДок.Variables("Доверенность").Value=" "+СокрЛП(Данные.основаниеПолномочий);	
		ТекДок.Variables("ДатаПоручения").Value=Формат(Объект.ДатаПоручения,"ДЛФ=DD");
		ТекДок.Variables("НомерПоручения").Value=СформироватьНомерПоручения(Данные);

		ТекДок.Fields.Update();
		Word.ActiveWindow.View.ShowFieldCodes = False;
		Word.Visible=Истина;
		
	КонецЦикла	//временныйПуть = КаталогВременныхФайлов();

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоручениеБКРегион()
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПоручениеБКРегион");
	
	ДанныеШапка = ПолучитьДанныеШапка(Объект.ЦеннаяБумага,Объект.ДатаОферты,Объект.Организация,Объект.Подписант);

	Для Каждого СтрТабл Из Объект.СчетаДоверительногоУправления цикл
		
		Данные = ПолучитьДанныеТЧ(ДанныеШапка,Объект.ДатаОферты,Объект.Организация,СтрТабл.СчетДоверительногоУправления,Объект.Брокер);

		имяВременногоФайла = ПолучитьИмяВременногоФайла();
		Макет.Записать(имяВременногоФайла);
		
		Word = Новый COMОбъект("Word.Application"); 
		
		ТекДок = Word.Documents.ADD(имяВременногоФайла);
		ТекДок.Variables("dat").Value=Объект.ДатаОферты;
		ТекДок.Variables("ПолноеНаименованиеКлиента").Value=Данные.НаименованиеДляДокументов;
		ТекДок.Variables("Организация").Value=СокрЛП(Объект.Организация);
		ТекДок.Variables("КодКлиента").Value=Данные.Код;
		ТекДок.Variables("ДатаДоговораБрокер").Value=Данные.ДатаДоговора;
		ТекДок.Variables("НомерДоговораБрокер").Value=Данные.НомерДоговора;
		ТекДок.Variables("РегНомер").Value=Данные.РегНомер;
		ТекДок.Variables("ISIN").Value=Данные.ISIN;
		ТекДок.Variables("Эмитент").Value=Данные.Эмитент;
		ТекДок.Variables("Количество").Value=СтрТабл.Количество;
		ТекДок.Variables("Процент").Value=Данные.ЦенаПроцент;
		ТекДок.Variables("Сумма").Value=Формат(СтрТабл.Сумма,"ЧЦ=17; ЧДЦ=2");
		ТекДок.Variables("Валюта").Value=Данные.валюта;
		ТекДок.Variables("СрокДействия").Value=Данные.ДатаВыкупа;
		ТекДок.Variables("Подписант").Value=СокрЛП(данные.Должность)+"  "+СокрЛП(Объект.Подписант);
		ТекДок.Variables("Доверенность").Value=" "+СокрЛП(Данные.основаниеПолномочий);	
		ТекДок.Variables("ДатаПоручения").Value=Формат(Объект.ДатаПоручения,"ДЛФ=DD");
		ТекДок.Variables("НомерПоручения").Value=СформироватьНомерПоручения(Данные);
		ТекДок.Variables("Серия").Value=Данные.Серия;
		ТекДок.Variables("ДополнительныеИнструкции").Value="Оферта, дата проведения "+Формат(Объект.ДатаОферты,"ДФ=dd.MM.yyyy");

		ТекДок.Fields.Update();
		Word.ActiveWindow.View.ShowFieldCodes = False;
		Word.Visible=Истина;
		
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка 'Печать оферт' не используется и не работает",,,, Отказ);
	Возврат;
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Если Параметры.Свойство("ПогашенияПлановые") тогда
		Для Каждого СтрокаПогашениеПланов Из Параметры.ПогашенияПлановые Цикл
			Если Не СтрокаПогашениеПланов.Флажок Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаПогашениеПланов.Брокер = Объект.Брокер Тогда
				ЗаполнитьЗначенияСвойств(Объект.СчетаДоверительногоУправления.Добавить(), СтрокаПогашениеПланов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.СчетаДоверительногоУправления.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано ни одного счета доверительного управления с брокером " + Объект.Брокер,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если      Объект.Тип = "Поручение по ГПБ" Тогда
		Элементы.Агент.Видимость = Истина;
		Элементы.Срок.Видимость  = Истина;
	ИначеЕсли Объект.Тип = "Поручение БК Регион" Или Объект.Тип = "Отмена поручения БК Регион" Тогда
		Элементы.ДатаПоручения.Видимость = Истина;
		Объект.ДатаПоручения = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		СотрудникиОрганизации = ПолучитьСотрудниковОрганизации(Объект.Организация);
		Элементы.Подписант.СписокВыбора.ЗагрузитьЗначения(СотрудникиОрганизации);
	КонецЕсли;
	
	 ЭтаФорма.Заголовок = Объект.Тип;
		
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Печать");
	Попытка
		ВыполнитьПечать(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечать(ПараметрыСессии)
	
	Если      Объект.Тип = "Поручение по ГПБ" тогда
		ПечатьПоручениеГПБ();
	ИначеЕсли Объект.Тип = "Намерение продать по ГПБ" тогда
		ПечатьОНамеренииПродатьГПБ();
	ИначеЕсли Объект.Тип = "Отмена поручения БК Регион" тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаПоручения) тогда
			Предупреждение("Не заполнена дата поручения!");
			ПараметрыСессии.ТекстОшибки = "Не заполнена дата поручения!";
			Возврат;
		КонецЕсли;
		ПечатьПоручениеНаОтменуБКРегион();
	ИначеЕсли Объект.Тип = "Поручение БК Регион" тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаПоручения) тогда
			Предупреждение("Не заполнена дата поручения!");
			ПараметрыСессии.ТекстОшибки = "Не заполнена дата поручения!";
			Возврат;
		КонецЕсли;
		ПечатьПоручениеБКРегион();
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
